/******************************************************************************
 *   서브시스템 : FDN서버
 *   프로그램명 : com9002.h
 *         기능 : 다운로드 시작
 *         설명 :
 *       작성자 :
 *       작성일 :
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_COM9002_H_
#define	_COM9002_H_

typedef struct _CCOM9002_R
{
	unsigned long temp_id           ;	// 컨테츠ID(T_CONTENTS_TEMP.id)
	char    user_id           [12+1];	// 사용자ID
	char    cont_gu           [ 2+1];	// 컨텐츠구분(WE:위디스크, MY:공개자료실, MD:내자료실)
	char    server_id         [ 5+1];	// 서버ID
	char    temp1             [   2];
	char    conn_ip           [19+1];	// 접속ID
	char	cer_key			  [20+1];
	char	temp			  [   3];
	double upload_size		        ;
}CCOM9002_R, *LPCCOM9002_R;



/*
typedef struct _CCOM9002_S
{
}CCOM9002_S, *LPCCOM9002_S;
*/
long com9002(CCOM9002_R pcom9002_r,int nFlag,char* szIP, int nPort);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
