/******************************************************************************
 *   서브시스템 : FUP서버
 *   프로그램명 : com9004.h
 *         기능 : 성인 컨텐츠 업로드 제한
 *         설명 : 성인물 10개 이상 업로드 금지
 *       작성자 : JDP
 *       작성일 : 2004/02/16
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_COM9004_H_
#define	_COM9004_H_

typedef struct _com9004_data
{
	long long temp_id ;
	double file_size	  ;
	char user_id[16];
	char auth_num[3];
	char szVersionData[4096];//no.767
}COM9004D,*LPCOM9004D;

//long com9004(unsigned long temp_id,double file_size);
COM9004D com9004(char* pUserID, unsigned long temp_id,double file_size, char* pBuffer/*no.767*/,char* szIP = NULL, int nPort=0);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
