/******************************************************************************
 *   서브시스템 : FUP서버
 *   프로그램명 : com9102.h
 *         기능 : upload 시작
 *         설명 : 서버에 업로드 종료 시점 호출되는 함수
 *       작성자 : JDP
 *       작성일 : 2004/10/02 토요일
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_COM9102_DSP_H_
#define	_COM9102_DSP_H_

typedef struct _CCOM9102_R
{
	unsigned long temp_id           ;	// 컨테츠ID(T_CONTENTS_TEMP.id)
	char    user_id           [12+1];	// 사용자ID
	char    cont_gu           [ 2+1];	// 컨텐츠구분(WE:위디스크, MY:공개자료실, MD:내자료실)
	char    server_id         [ 5+1];	// 서버ID
	char    temp1             [   2];
	char    conn_ip           [19+1];	// 접속ID
	double upload_size		        ;
}CCOM9102_R, *LPCCOM9102_R;

/*
typedef struct _CCOM9102_S
{
}CCOM9102_S, *LPCCOM9102_S;
*/
long com9102dsp(CCOM9102_R pcoM9102_r,char* szIP, int nPort);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
