/******************************************************************************
 *   서브시스템 : FDN
 *   프로그램명 : com9009.h
 *         기능 :
 *         설명 : 컨텐츠 서버 업/다운로드 카운트 전달
 *       작성자 :
 *       작성일 : 2015.07.25
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_COM9009_H_
#define	_COM9009_H_

typedef struct _CCOM9009_R
{
	char    server_id         [ 5+1];	// 서버ID
	int		nConnectCnt;
	int		nMode;				// 0 : dn , 1 : up 
	unsigned long uDisksize;
	unsigned long uUsesize;
	unsigned long uFreesize;
}CCOM9009_R, *LPCCOM9009_R;


/*
typedef struct _CCOM9009_S
{
}CCOM9009_S, *LPCCOM9009_S;
*/
long com9009(CCOM9009_R pcom9009_r,char* szIP, int nPort);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
