/******************************************************************************
 *   서브시스템 : FDN
 *   프로그램명 : com9010.h
 *         기능 :
 *         설명 : 컨텐츠 서버 업/다운로드 카운트 전달
 *       작성자 :
 *       작성일 : 2015.07.25
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_com9010_H_
#define	_com9010_H_


typedef struct _CCOM9010_R
{
	char    osp_id         [10];
	char    server_id      [10+1];
	int		nConnectCnt;
	int		nRealDownCnt;
	int		nPort;
	int		nMode;				// 0 : dn , 1 : up
	int		nAppand;			// 0 : new , 1 : appand
	unsigned long uFileid;
	unsigned long uDisksize;
	unsigned long uUsesize;
	unsigned long uFreesize;

}CCOM9010_R, *LPCCOM9010_R;


long com9010(CCOM9010_R pcom9010_r,char* szIP, int nPort);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
