/******************************************************************************
 *   서브시스템 : CMD서버
 *   프로그램명 : cmds1002.h
 *         기능 : 사용자ID롤 공유등록 자료를 검색한다.
 *         설명 :
 *       작성자 : JDP
 *       작성일 : 2004/02/16
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_CMDS1002_H_
#define	_CMDS1002_H_

#include "comhead.h"
/*----------------------------------------------------------------------------*/
/*   WE디스크 조회 요청                                                       */
/*----------------------------------------------------------------------------*/
typedef struct _CCMDS1002_R
{
	int     find_flag               ;  // 검색구분 [1]등록현황 [2]다운로드현황
	char    user_id           [12];  // 사용자ID
}CCMDS1002_R,*LPCCMDS1002_R;

/*----------------------------------------------------------------------------*/
/*   WE디스크 조회 응답                                                       */
/*----------------------------------------------------------------------------*/
typedef struct _CCMDS1002_S
{
	
    int     server_port           ;  // 서버PORT
	int     price_amt             ;  // 희망가격
	int     won_mega              ;  // 원당메가
	int     qury_cnt              ;  // 조회건수
	int     down_cnt              ;  // 다운로드건수
	int     disp_day              ;  // 잔여일
	char    title          [200+1];  //  201 제목
	char    sect_code      [  2+1];  //  204 분류코드
	char    sect_name      [ 80+1];  //  285 분류명칭
	char    share_meth     [  2+1];  //  288 공유방법
	char    share_name     [ 80+1];  //  369 공유방법
	char    reg_user       [ 12+1];  //  382 등록자
	char    folder_yn      [  1+1];  //  384 폴더여부
	char    file_path      [255+1];  //  640 파일경로
	char    file_name1     [255+1];  //  896 서버파일이름
	char    file_name2     [255+1];  // 1152 로컬파일이름
    char    server_id      [  5+1];  // 1158 서버ID
    char    server_ip      [ 15+1];  // 1174 서버IP
    char    down_yn        [  1+1];  // 1176
    unsigned long id              ;  // 컨테츠ID
	unsigned long deal_no         ;  // 거래번호
	double  file_size             ;  // 파일사이즈
}CCMDS1002_S,*LPCCMDS1002_S;

int cmds1002(char *pRecvHead, char *pRecvData, char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
