/******************************************************************************
 *   서브시스템 : CMD서버
 *   프로그램명 : cmds1004.h
 *         기능 : Disk서비스를 사용하기 위해 인증을 한다.
 *         설명 :
 *       작성자 : JDP
 *       작성일 : 2004/02/16
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_CMDS10041_H_
#define	_CMDS10041_H_

#include "comhead.h"
/*----------------------------------------------------------------------------*/
/*   로그인인증 요청                                                          */
/*----------------------------------------------------------------------------*/
typedef struct _CCMDS10041_R
{
	char    user_id           [12+1];  // 사용자ID
	char    sess_id           [50+1];  // 세션ID
}CCMDS10041_R,*LPCCMDS10041_R;

/*----------------------------------------------------------------------------*/
/*   로그인인증 응답                                                          */
/*----------------------------------------------------------------------------*/
typedef struct _CCMDS10041_S
{
	int     my_stat                ;   // 1: 인증실패, 2:인증성공, 3:인증성공 & MYDISK OK
	char    server_id        [ 5+1];   // 서버ID
	char    server_ip        [15+1];   // 서버IP
	char    temp             [   1];   // filler 
	int     mys_port               ;   // MYD server PORT
	int     ups_port               ;   // MYD upload PORT
	int     dns_port               ;   // MYD download PORT
	int     free_yn                ;   // 무료디스크설정     [0=미설정, 1=설정]
	int     recv_cd                ;   // 오프라인시파일받기 [0=미사용, 1=친구, 2=모두] 
	int     share_cd               ;   // 내공유폴더 공개    [1=모두공개, 2=선택사용자]
	char    root_path       [255+1];   // 개인root Path
	char    ed_date         [  8+1];   // 내디스크 사용만료일
}CCMDS10041_S, *LPCCMDS10041_S;

int cmds10041(char *pRecvHead, char *pRecvData, char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
