/******************************************************************************
 *   서브시스템 : FUP서버
 *   프로그램명 : com9103.h
 *         기능 : 내디스크사용량UPDATE
 *         설명 : 내디스크에 파일upload, 복사, 삭제시 디스크사용량을 UPDATE한다
 *       작성자 : JDP
 *       작성일 : 2004/07/28 엄청 더운날
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_DCMD9103_H_
#define	_DCMD9103_H_
#include "comhead.h"

/*
typedef struct _CCOM9103_R
{
	int     proc_flag               ;  // 1=wedisk, 2=mydisk, 3=mydata 	4=filog disk
	double  file_size               ;  // 파일크기
	char    user_id           [12+1];  // 사용자
	char    temp              [   3];
}CCOM9103_R, *LPCCOM9103_R;

/*
typedef struct _CCOM9103_S
{
}Ccom9103_S, *LPCCOM9103_S;
*/
long dcmd9103(int sock , LPHEADER pHeader , char* pRecvData , char* &pSendData);   //CCOM9103_R pcom9103_r,char* pErrMsg);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
