/******************************************************************************
 *   서브시스템 : database command 서버
 *   프로그램명 : dcmd9204.h - com9204.h 호출
 *         기능 : 한시간마다 접속자수 업데이트
 *         설명 : 한시간마다 컨텐츠서버의 접속자수를 확인하여 업데이트
 *       작성자 : HCS
 *       작성일 : 2007/10/08
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_DCMD9204_H_
#define	_DCMD9204_H_
#include "comhead.h"
/*

typedef struct _CCOM9201_R
{
	char    user_id           [16];	// 사용자ID
	char    conn_ip           [16];	// 접속ip
}CCOM9201_R, *LPCCOM9201_R;

*/

long dcmd9204(int sock , LPHEADER pHeader , char* pRecvData , char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
