/******************************************************************************
 *   서브시스템 : database command 서버
 *   프로그램명 : dcmd9202.h - com9202.h 호출
 *         기능 : fupserver 실행시 초기화
 *         설명 : T_SERVER_INFO 의 up_user와 up_size를 0으로 초기화
 *       작성자 : HCS
 *       작성일 : 2007/10/01 월요일
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_DCMD9202_H_
#define	_DCMD9202_H_
#include "comhead.h"
/*

typedef struct _CCOM9201_R
{
	char    user_id           [16];	// 사용자ID
	char    conn_ip           [16];	// 접속ip
}CCOM9201_R, *LPCCOM9201_R;

*/

long dcmd9202(int sock , LPHEADER pHeader , char* pRecvData , char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
