/******************************************************************************
 *   서브시스템 : database command 서버
 *   프로그램명 : dcmd9205.h - com9205.h 호출
 *         기능 : fdnserver 시작시 초기화
 *         설명 : fdnserver 실행(재실행)시에 T_SERVER_INFO의 dn_user, T_CONTENTS_FILE_USER_CNT의 cur_user_cnt를 초기화
 *       작성자 : HCS
 *       작성일 : 2007/09/28 금요일
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_DCMD9205_H_
#define	_DCMD9205_H_
#include "comhead.h"
/*

typedef struct _CCOM9201_R
{
	char    user_id           [16];	// 사용자ID
	char    conn_ip           [16];	// 접속ip
}CCOM9201_R, *LPCCOM9201_R;

*/

long dcmd9205(int sock , LPHEADER pHeader , char* pRecvData , char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
