/******************************************************************************
 *   서브시스템 : database command 서버
 *   프로그램명 : dcmd9001.h - com9001.h 호출
 *         기능 : upload 시작
 *         설명 : 서버에 업로드하기 전에 호출되는 함수
 *       작성자 : LEE
 *       작성일 : 2005/9/03 토요일
 *     수정이력 :
********************************************************************************
1         2         3         4         5         6         7         8
12345678901234567890123456789012345678901234567890123456789012345678901234567890
*******************************************************************************/
#ifndef	_DCMD9001_H_
#define	_DCMD9001_H_
#include "comhead.h"
/*

typedef struct _CCOM9001_R
{
	unsigned long temp_id           ;	// 컨테츠ID(T_CONTENTS_TEMP.id)
	char    user_id           [12+1];	// 사용자ID
	char    cont_gu           [ 2+1];	// 컨텐츠구분(WE:위디스크, MY:공개자료실, MD:내자료실)
	char    server_id         [ 5+1];	// 서버ID
	char    temp1             [   2];
	char    conn_ip           [19+1];	// 접속ID
	double upload_size		        ;
}CCOM9001_R, *LPCCOM9001_R;
*/

long dcmd9001(int sock , LPHEADER pHeader , char* pRecvData , char* &pSendData);
#endif

/******************************************************************************
 * End of file...
 *****************************************************************************/
